[
  {
    "date": "2025-11-06T21:22:32.775000+00:00",
    "text": "We have a call for posters out! Please submit your extended abstracts, it should be quick and easy. And just like last year, provocative work is especially encouraged as it makes for such interesting conversation 😈",
    "has_embed": true
  },
  {
    "date": "2025-11-02T12:25:33.448000+00:00",
    "text": "This. Copyright is a tool for protection but it’s not everything. In fact, there’s research showing that it is possible to create competitive language models using public domain data only. The proliferation of copyright respecting models would not solve the labor impact policy problem.",
    "has_embed": true
  },
  {
    "date": "2025-11-01T16:46:55.561000+00:00",
    "text": "Going to San Diego for Neurips? We at @eval-eval.bsky.social , along with the UK AISI, are hosting a closed door state of evals workshop at @ucsandiego.bsky.social on Dec 8th. \n\nRequest to join below! :) \n\nevaleval.github.io/events/works...",
    "has_embed": true
  },
  {
    "date": "2025-10-28T16:33:46.778000+00:00",
    "text": "Datasets are the backbone of AI for Science, and we want to support scientific data natively on Hugging Face. The amazing @lhoestq.hf.co started a discussion on GH for this! Please engage (better still, submit a PR) so we can start supporting your 🫵 dataset:\n\ngithub.com/huggingface/...",
    "has_embed": true
  },
  {
    "date": "2025-10-24T18:32:03.401000+00:00",
    "text": "Random off the cuff observation about American AI: LLM folks seem to be concentrated in SF, but AI4Science folks seem to be concentrated in Boston. Meaning as the former gets oversaturated and the latter is only getting started, I expect Boston to be the next big AI epicenter! 💪",
    "has_embed": false
  },
  {
    "date": "2025-10-24T16:44:08.203000+00:00",
    "text": "🌟 Weekly AI Evaluation Spotlight 🌟\n\n🤖 Did you know malicious actors can exploit trust in AI leaderboards to promote poisoned models in the community? \n\nThis week's paper 📜\"Exploiting Leaderboards for Large-Scale Distribution of Malicious Models\" by @iamgroot42.bsky.social explores this!",
    "has_embed": true
  },
  {
    "date": "2025-10-20T19:01:32.634000+00:00",
    "text": "+1000. I miss life pre-AI hype when the discourse around AI was more scientific and people used to attribute papers and opinions to scientists instead of to their companies. Not all orgs block research papers and sanity check their papers via legal teams, and HF, especially so, is very distributed.",
    "has_embed": true
  },
  {
    "date": "2025-10-20T13:44:42.507000+00:00",
    "text": "Hey, so can someone tell me why ChatGPT generating erotica is bad, any more so than it generating anything else? Obviously anything non-consensual or age-inappropriate is bad, but I don't see why some researchers in my timeline are up in arms about it, while Grok already does this.",
    "has_embed": false
  },
  {
    "date": "2025-10-17T16:56:37.004000+00:00",
    "text": "We're starting a weekly paper spotlight series! Come engage with the posts and let's improve evals together! :) \n\nFirst up: Do Large Language Model Benchmarks Test Reliability?",
    "has_embed": true
  },
  {
    "date": "2025-10-16T19:53:10.786000+00:00",
    "text": "I had never seen people fighting with co-authors via colored latex comments on overleaf in a developing paper draft until today. One of them even pasted a google calendar link saying \"can we hop on a call and hash this out\". Paper writing is actually exciting sometimes!",
    "has_embed": false
  },
  {
    "date": "2025-10-12T21:17:47.933000+00:00",
    "text": "Trying to start a new hobby and the internet is useless. Maybe AI will finally kill unstructured information retrieval for good and then we will be forced to call or visit friends for help again",
    "has_embed": true
  },
  {
    "date": "2025-10-08T20:08:44.750000+00:00",
    "text": "More of such research please! Chatbots are not the future of science, science is",
    "has_embed": true
  },
  {
    "date": "2025-10-08T00:46:29.424000+00:00",
    "text": "Some of these new gpt/claude wrapper startups make me wonder how much the founders are paying themselves in salary because there is no way they expect their horrible idea to actually be sustainably profitable",
    "has_embed": false
  },
  {
    "date": "2025-10-06T16:28:00.185000+00:00",
    "text": "AI for scientific discovery is a social problem: In our new position paper, @cgeorgiaw.bsky.social and I show that culture, incentives, and coordination are the main obstacles to progress, and we are launching the Hugging Science Initiative to address this!",
    "has_embed": true
  },
  {
    "date": "2025-10-01T17:56:49.436000+00:00",
    "text": "At a panel a couple of weeks ago I exclaimed in despair: “who decided that the only mode of interacting with AI is via chatbots?” And this trend is relentless still.\n\nwww.theverge.com/news/787076/...",
    "has_embed": true
  },
  {
    "date": "2025-09-28T21:36:52.223000+00:00",
    "text": "Wife brought her 100 year old film camera to that pirates game from a few weeks ago and she got this shot that's just perfect",
    "has_embed": true
  },
  {
    "date": "2025-09-28T16:03:04.565000+00:00",
    "text": "So fascinating (not really) to me that company execs and tier 1 AI conferences have gone in completely opposite directions as it relates to AI usage. Surely the best minds actually developing AI models know something about overreliance, productivity, and quality? Surely?",
    "has_embed": true
  },
  {
    "date": "2025-09-25T22:45:55.437000+00:00",
    "text": "This phenomenon needs a nice catchy name because every research paper (including my own) that refers to it uses as many words but it’s an insidious problem",
    "has_embed": true
  },
  {
    "date": "2025-09-23T21:07:13.324000+00:00",
    "text": "I’m back at my alma mater today to talk about personal anecdotes of how I have experienced AI, how those experiences fueled my research, and the kind of questions that still remain. Looking forward to it! 🤗\n\nwww.eventbrite.com/e/personal-a...",
    "has_embed": true
  },
  {
    "date": "2025-09-19T01:45:15.468000+00:00",
    "text": "I’m just going to play that South Park episode on a loop at people now. It was so spot on",
    "has_embed": true
  },
  {
    "date": "2025-09-17T09:26:41.875000+00:00",
    "text": "This continues to be a recurring theme -_- Why is consumer agency so scary to the market? Noticed the same trend when I worked at Twitter: the personalization team cared for engagement metrics way more than actually showing users what they wanted to follow: “people don’t know what they like”",
    "has_embed": true
  },
  {
    "date": "2025-09-16T16:29:37.612000+00:00",
    "text": "🤖 As AI-generated content is shared in movies/TV/across the web, there's one simple low-hanging fruit 🍇 to help know what's real: Visible watermarks. With others @hf.co, I've made sure it's trivially easy to add this disclosure to images, video, chatbot text. See how:\nhuggingface.co/blog/waterma...",
    "has_embed": true
  },
  {
    "date": "2025-09-14T19:05:02.043000+00:00",
    "text": "I wish there was a way for arxiv to take me to the abstract page by default instead of the html page 😬 it is strictly worse",
    "has_embed": false
  },
  {
    "date": "2025-09-11T16:58:38.103000+00:00",
    "text": "I adore the public library. I just put 15 picture books on hold for my kiddo, on trains (current obsession) and beaches (first visit soon). We'll pick them up after they're all gathered at our branch. This is free!\n\nYou all know this, I just feel the need to say it out loud occasionally.",
    "has_embed": false
  },
  {
    "date": "2025-09-08T14:25:35.446000+00:00",
    "text": "It's interesting to think that the visual depiction of the word \"AI\" is still strongly coupled to humanoid robots even as the most popular applications of what we currently think of AI are not that. Terminology overloading over time is fascinating to live through.",
    "has_embed": false
  },
  {
    "date": "2025-08-31T17:41:12.949000+00:00",
    "text": "The Kant Car",
    "has_embed": true
  },
  {
    "date": "2025-08-29T18:04:29.155000+00:00",
    "text": "Research posts on Bluesky are more original — and get better engagement www.nature.com/articles/d41...",
    "has_embed": true
  },
  {
    "date": "2025-08-26T17:25:26.942000+00:00",
    "text": "It’s fascinating to see the time gap between Taylor swift’s engagement insta post and full length news articles pop up. Journalist folks please tell me do you have these pre-written just in case or are you just that proficient?",
    "has_embed": false
  },
  {
    "date": "2025-08-20T16:18:29.250000+00:00",
    "text": "Thinking a lot about documentation standards today. I would be very interested in people's thoughts on what factors lead to a documentation schema to become a standard? Thinking about datasheets vs model cards for eg, and how one became a (somewhat) durable standard..",
    "has_embed": false
  },
  {
    "date": "2025-08-17T17:08:36.171000+00:00",
    "text": "My favorite thing about the Gemini chain of thoughts is how it says “I am now laser focused on” <insert part of code that I asked to fix>. It’s cute",
    "has_embed": true
  },
  {
    "date": "2025-08-17T14:13:21.909000+00:00",
    "text": "I genuinely want to know the thought process here. Is each model iteration a new being? Is Claude 4.1 its own legal entity deserving of model welfare different from 4.0? Or is it like one human updating their world knowledge and becoming smarter? Was the very first trained Claude the robot embryo?",
    "has_embed": true
  },
  {
    "date": "2025-08-11T19:47:02.823000+00:00",
    "text": "Remember the discussions around AI Eval plots last week? We at @eval-eval.bsky.social have a quick blog post on the AI Eval Charts Crisis!",
    "has_embed": false
  },
  {
    "date": "2025-08-08T17:24:43.915000+00:00",
    "text": "The product decision to discontinue older versions of ChatGPT and the comments on Reddit around that decision reminded me once again of discussions around “robot death”, which is real insofar as people’s feelings and emotions are real.",
    "has_embed": true
  },
  {
    "date": "2025-08-08T00:54:24.466000+00:00",
    "text": "New paper idea: Graph Crimes in Evaluations as a form of Epistemic Injustice",
    "has_embed": false
  },
  {
    "date": "2025-08-07T14:51:48.842000+00:00",
    "text": "I’ve made my husband laugh with the same joke 3 times I feel so powerful",
    "has_embed": false
  },
  {
    "date": "2025-07-21T17:11:35.629000+00:00",
    "text": "This! Also begets the question, why are people starting to get averse to social forms of knowledge production, involving multi-level stakeholders? Why is this mad rush to clip out the humans from the process, instead of working in tandem?",
    "has_embed": true
  },
  {
    "date": "2025-07-16T17:17:29.891000+00:00",
    "text": "🚨 AI Evals Crisis: Officially kicking off the Eval Science Workstream 🚨\n\nWe’re building a shared scientific foundation for evaluating AI systems, one that’s rigorous, open, and grounded in real-world & cross-disciplinary best practices👇 (1/2)\n\nRead our new blog post: tinyurl.com/evalevalai",
    "has_embed": true
  },
  {
    "date": "2025-07-15T19:20:26.931000+00:00",
    "text": "[New] Husbandposting! And yes we had a croquembouche for dessert because I saw it on masterchef once and I’ve always wanted that ❤️",
    "has_embed": true
  },
  {
    "date": "2025-07-15T14:31:00.565000+00:00",
    "text": "New blog post alert! 🚨\"What is the Hugging Face Community Building?\", with @yjernite.bsky.social and Irene Soliaman\n \nThe AI narrative focuses on big players, but the real story is happening in the open source AI ecosystem across 1.8M models, 450K datasets, and 560K apps, on  \n@hf.co.",
    "has_embed": false
  },
  {
    "date": "2025-07-03T19:04:10.992000+00:00",
    "text": "Gotta plug @timnitgebru.bsky.social @alexhanna.bsky.social and Asmelash Teka Hadgu's piece:\n\nwww.dair-institute.org/blog/elders/\n\nAnd @anikacolliernavaroli.com's excellent interview with Timnit on the subject: www.techpolicy.press/through-to-t...",
    "has_embed": true
  },
  {
    "date": "2025-07-03T14:20:35.574000+00:00",
    "text": "Random hot take: Too many people are building AI for genz and not enough are building for their grandparents. Where are the apps/bots that say a retired, perhaps non English speaking grandma can use to improve their lives?",
    "has_embed": false
  },
  {
    "date": "2025-07-03T13:56:51.062000+00:00",
    "text": "Not enough people know about nairrpilot.org and it shows. NAIRR needs better marketing and more resources to become a strong public computing infrastructure for American researchers and builders! 🇺🇸\n\n@hf.co is one of many resources you can access through NAIRR ;)",
    "has_embed": true
  },
  {
    "date": "2025-07-01T16:06:56.508000+00:00",
    "text": "I still think the set design of the Evita revival at the American Rep theater at Harvard was the most stunning interpretation of all time - I hope this concept makes it to Broadway at some point 🤩",
    "has_embed": true
  },
  {
    "date": "2025-07-01T15:40:21.195000+00:00",
    "text": "Help this project out by participating if it’s up your alley! Moral KG is an ambitious attempt to map AI reasoning traces onto a developing massive philosophical ontology, and very much being built as a bootstrap effort with a rag tag team 🤗",
    "has_embed": true
  },
  {
    "date": "2025-06-23T14:47:00.169000+00:00",
    "text": "Go say hi to @jennmickel.bsky.social and others and get to know what we are doing!",
    "has_embed": true
  },
  {
    "date": "2025-06-22T22:36:23.528000+00:00",
    "text": "We're doing better AI Evals together! A herculean effort, but evals are in crisis and together we can go back to  research roots and good science 🤗",
    "has_embed": true
  },
  {
    "date": "2025-06-17T13:52:43.966000+00:00",
    "text": "Generative AI often renders the user invisible in their limited worldview. Please sign up for a short interactive workshop on AI, Misrepresentation and Mental Health, at both @facct.bsky.social in Athens, and Alt-FAccT in NYC! Limited space, so hurry! \n\nSign up here! tinyurl.com/ai-mirrors",
    "has_embed": true
  },
  {
    "date": "2025-06-15T00:20:38.526000+00:00",
    "text": "Alright, people, let's be honest: GenAI systems are everywhere, and figuring out whether they're any good is a total mess. Should we use them? Where? How? Do they need a total overhaul?\n\n(1/6)",
    "has_embed": false
  },
  {
    "date": "2025-06-13T17:13:40.871000+00:00",
    "text": "I'm very pleased that both FAccT and AIES have way more qualitative evals of systems than I have seen in previous years. More of these please!",
    "has_embed": false
  },
  {
    "date": "2025-06-09T12:11:53.065000+00:00",
    "text": "Living downtown and literally 2 blocks from the Opera House is certainly a clutch because I’m always late to things. Catch Roméo et Juliette playing in Boston it was great 😍",
    "has_embed": true
  },
  {
    "date": "2025-06-08T14:15:11.650000+00:00",
    "text": "Competitive language models trained on fully openly licensed data is possible! Don’t let for profit orgs tell you otherwise.😉 Incredible work by some of my favorite folks across organizations.",
    "has_embed": true
  },
  {
    "date": "2025-06-08T12:42:47.225000+00:00",
    "text": "I’ll be at alt-FAccT in New York on June 20! Skipping Athens this year for personal reasons (but a really good one 💍) so I’d love to see you if you’re going! 🤗",
    "has_embed": false
  },
  {
    "date": "2025-06-08T12:36:03.083000+00:00",
    "text": "And now add AI Agents to the conversation, and we’re looking at a dire need for infrastructure overhaul",
    "has_embed": true
  },
  {
    "date": "2025-06-07T21:52:41.474000+00:00",
    "text": "I miss the research hangout atmosphere of the old Twitter, it’s just all politics on X and on Bsky now - just on opposite sides of the spectrum. Sorry to say but it seems like special interest subreddits are the last bastion standing 😅",
    "has_embed": false
  },
  {
    "date": "2025-06-06T19:18:56.466000+00:00",
    "text": "Can you train a performant language model using only openly licensed text?\n\nWe are thrilled to announce the Common Pile v0.1, an 8TB dataset of openly licensed and public domain text. We train 7B models for 1T and 2T tokens and match the performance similar models like LLaMA 1 & 2",
    "has_embed": true
  }
]